zephyrproject-rtos/zephyr/boards/sensoan/sgw2/sgw2_nrf9160.h
/*
 * Copyright (c) 2024 Sensoan Oy
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef SGW2_NRF9160_H
#define SGW2_NRF9160_H

#include "board.h"

#define MCU_IF_PORT_0 0
#define MCU_IF_PIN_0  2
#define MCU_IF_PORT_1 0
#define MCU_IF_PIN_1  1
#define MCU_IF_PORT_2 0
#define MCU_IF_PIN_2  0
#define MCU_IF_PORT_3 0
#define MCU_IF_PIN_3  31
#define MCU_IF_PORT_4 0
#define MCU_IF_PIN_4  30
#define MCU_IF_PORT_5 0
#define MCU_IF_PIN_5  29
#define MCU_IF_PORT_6 0
#define MCU_IF_PIN_6  28

#define EDGE_CONN_PORT_7  0
#define EDGE_CONN_PIN_7   8
#define EDGE_CONN_PORT_8  0
#define EDGE_CONN_PIN_8   9
#define EDGE_CONN_PORT_9  0
#define EDGE_CONN_PIN_9   10
#define EDGE_CONN_PORT_11 0
#define EDGE_CONN_PIN_11  13
#define EDGE_CONN_PORT_17 0
#define EDGE_CONN_PIN_17  14
#define EDGE_CONN_PORT_18 0
#define EDGE_CONN_PIN_18  16
#define EDGE_CONN_PORT_19 0
#define EDGE_CONN_PIN_19  15
#define EDGE_CONN_PORT_20 0
#define EDGE_CONN_PIN_20  18
#define EDGE_CONN_PORT_21 0
#define EDGE_CONN_PIN_21  17
#define EDGE_CONN_PORT_22 0
#define EDGE_CONN_PIN_22  20
#define EDGE_CONN_PORT_23 0
#define EDGE_CONN_PIN_23  19
#define EDGE_CONN_PORT_31 0
#define EDGE_CONN_PIN_31  27
#define EDGE_CONN_PORT_33 0
#define EDGE_CONN_PIN_33  11
#define EDGE_CONN_PORT_38 0
#define EDGE_CONN_PIN_38  25
#define EDGE_CONN_PORT_39 0
#define EDGE_CONN_PIN_39  24
#define EDGE_CONN_PORT_40 0
#define EDGE_CONN_PIN_40  23
#define EDGE_CONN_PORT_41 0
#define EDGE_CONN_PIN_41  22
#define EDGE_CONN_PORT_42 0
#define EDGE_CONN_PIN_42  21
#define EDGE_CONN_PORT_48 0
#define EDGE_CONN_PIN_48  12

#endif /* SGW2_NRF9160_H */
